package cn.qfys521.xiaoming.sakura.command.omikuji

object OmikujiMessages {

    val health = mapOf(
        2 to "◇ 寻找中的失物：似乎就在你触手可及的地方",
        3 to "◇ 寻找中的失物：近期或许可以找到",
        4 to "◇ 寻找中的失物：近期或许找不到",
        5 to "◇ 寻找中的失物：放弃似乎是更好的选择",
        6 to "◇ 寻找中的失物：似乎非常难在未来重获它",
        7 to "◇ 寻找中的失物：似乎可以找到颇为完美的替代品"
    )

    val love = mapOf(
        2 to "◇ 等待的人：似乎就在你的日常生活之中",
        3 to "◇ 等待的人：近期或许会出现",
        4 to "◇ 等待的人：近期或许不会出现",
        5 to "◇ 等待的人：你与对方似乎暂无缘分的交集",
        6 to "◇ 等待的人：似乎与你擦肩而过了数次"
    )

    val family = mapOf(
        2 to "◇ 下一场旅行：可能要做好遇到突发情况的准备",
        3 to "◇ 下一场旅行：可能要带上以往不需要的事物",
        4 to "◇ 下一场旅行：可能可以舍弃一些以往经常携带的事物",
        5 to "◇ 下一场旅行：或许会一帆风顺",
        6 to "◇ 下一场旅行：可能要做好出发或归来的日程推迟或提前的准备",
        7 to "◇ 下一场旅行：可能需要破财消灾",
        8 to "◇ 下一场旅行：可能需要看管好自己的随身财物"
    )

    val friend = mapOf(
        2 to "◇ 恋爱走向：近期可能要多上心一些",
        3 to "◇ 恋爱走向：近期或许会一帆风顺",
        4 to "◇ 恋爱走向：近期或许会有微小的坎坷",
        5 to "◇ 恋爱走向：或许近期需要少去在意",
        6 to "◇ 恋爱走向：或许该送出某种形式的礼物了",
        7 to "◇ 恋爱走向：或许该表达更进一步的意愿了"
    )

    val career = mapOf(
        2 to "◇ 正在纠结的开支：或许该付出这笔钱财",
        3 to "◇ 正在纠结的开支：或许不该付出这笔钱财",
        4 to "◇ 正在纠结的开支：或许找错了付出钱财的方向",
        5 to "◇ 正在纠结的开支：或许付出了也无法获得想要的结果",
        6 to "◇ 正在纠结的开支：或许会通过某种方式回到你的手中",
        7 to "◇ 正在纠结的开支：或许付出它也不算是真正地失去它"
    )
}
